javascript
var schoolSubjects = [
{ предмет: "Математика", "количество часов в неделю": 3},
{ предмет: "Физика", "количество часов в неделю": 5 },
{ предмет: "Биология", "количество часов в неделю": 6},
{ предмет: "История", "количество часов в неделю": 3},
{ предмет: "Английский язык", "количество часов в неделю": 2},
{ предмет: "Химия", "количество часов в неделю": 4},
{ предмет: "Литература", "количество часов в неделю": 3},
{ предмет: "География", "количество часов в неделю": 2},
{ предмет: "Физическая культура", "количество часов в неделю": 2},
{ предмет: "Информатика", "количество часов в неделю": 4 }
];

var i = 0;
var foundSubjects = false;

while (i < schoolSubjects.length) {
if (schoolSubjects[i]["количество часов в неделю"] > 3) {
    console.log(schoolSubjects[i].предмет);
    foundSubjects = true;
}
i++;
}

if (!foundSubjects) {
console.log("Все предметы изучаются менее трех часов в неделю.");
}